<%@ page contentType="text/html; charset=UTF-8" language="java" import="java.io.*, java.sql.*" errorPage="" %>
<% request.setCharacterEncoding("UTF-8");%>
<!DOCTYPE html>
<%
	String username_session = (String)session.getAttribute("username_session");
%>
<html>
<title>ข้อมูลจังหวัด</title>
<head>
	<meta charset="utf-8">
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <meta name="description" content="">
    <meta name="author" content="">
    <link rel="icon" href="../../favicon.ico">
   	<link href="css/bootstrap.min.css" rel="stylesheet">
	<script src="assets/js/ie-emulation-modes-warning.js"></script>
	<script src="assets/js/ie10-viewport-bug-workaround.js"></script>
	<link href="carousel.css" rel="stylesheet">
</head>
<body>


  <nav class="navbar navbar-inverse" role="navigation">
   <div class="container">
    <div class="navbar-header">
      <button type="button" class="navbar-toggle" data-toggle="collapse" data-target=".navbar-ex1-collapse">
        <span class="sr-only">Toggle navigation</span>
        <span class="icon-bar"></span>
        <span class="icon-bar"></span>
        <span class="icon-bar"></span>
      </button>
      <a class="navbar-brand">เพชรบูรณ์</a>
    </div>

    <div class="collapse navbar-collapse navbar-ex1-collapse">
      <ul class="nav navbar-nav">
        <li><a href="index.jsp">หน้าหลัก</a></li>
        <li><a href="travel.jsp">ที่ท่องเที่ยว</a></li>
        <li><a href="rest.jsp">ที่พัก</a></li>
        <li><a href="eat.jsp">ที่กิน</a></li>
        <li class="active"><a href="about.jsp">ข้อมูลจังหวัด</a></li>
        <li><a href="contact.jsp">ติดต่อเรา</a></li>
      </ul>
      
      <ul class="nav navbar-nav navbar-right">
            <% if(null!=username_session){ %>
            	<li>
                    <a href="#">Hi'&nbsp;&nbsp;<%=username_session%></a>
                </li>
                <li>
                    <a href="logout.jsp">Logout</a>
                </li>
            <% } else { %>
      
     	<div class="form-group">
        <form action="chkLogin.jsp" method="post" class="navbar-form navbar-right" role="form">
          <input type="text" class="form-control" id="username" name="username" placeholder="Username" required>
          <input type="password" class="form-control" id="password" name="password" placeholder="Password" required>
          <input type="submit" name="submit" value="Sign in">
        </form>
        </div>
      
      <% } %>
      </ul>
      
    </div>
  </div>
</nav>

<div class="container">
	<div id="myCarousel" class="carousel slide" data-ride="carousel">
  		<!-- Indicators -->
  		<ol class="carousel-indicators">
    		<li data-target="#myCarousel" data-slide-to="0" class="active"></li>
    		<li data-target="#myCarousel" data-slide-to="1"></li>
    		<li data-target="#myCarousel" data-slide-to="2"></li>
  		</ol>
  			<div class="carousel-inner">
    			<div class="item active">
      			<img src="img/_DSF5894.jpg" alt="First slide">
      			<div class="carousel-caption"></div>
    			</div>
    			<div class="item">
      			<img src="img/IMG_9222.jpg" alt="Second slide">
      			<div class="carousel-caption"></div>
    			</div>
    			<div class="item">
      			<img src="img/IMG_9121.jpg" alt="Third slide">
      			<div class="carousel-caption"></div>
  				</div>
  			</div>
		<a class="left carousel-control" href="#myCarousel" role="button" data-slide="prev"><span class="glyphicon glyphicon-chevron-left"></span></a>
		<a class="right carousel-control" href="#myCarousel" role="button" data-slide="next"><span class="glyphicon glyphicon-chevron-right"></span></a>
		<marquee id="adver"></marquee>
	</div>
</div>	<!-- /.carousel -->

<div class="container">
  <div class="col-md-12">
    <div class="panel panel-default">
      <div class="panel-heading">
        <h4><span class="glyphicon glyphicon-cloud"></span>&nbsp;ข้อมูลทั่วไปจังหวัด</h4>
      </div>
      <div class="panel-body">
        <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;จังหวัดเพชรบูรณ์ตั้งอยู่ในเขตภาคเหนือตอนล่าง แวดล้อมไปด้วยพื้นที่ป่าเขาเขียวขจี ภูมิประเทศมีทัศนียภาพที่สวยงาม ตัวเมืองตั้งอยู่ห่างจากกรุงเทพฯ ประมาณ 346 กิโลเมตร อยู่สูงจากระดับน้ำทะเลโดยเฉลี่ย 114 เมตร ลักษณะภูมิประเทศเป็นที่ลุ่มแบบท้องกระทะ พื้นที่ของจังหวัดมีลักษณะลาดชันจากทิศเหนือไปทิศใต้ ตอนเหนือเป็นทิวเขาสูง ตอนกลางเป็นที่ราบขนาบด้วยเทือกเขาเพชรบูรณ์ทางทิศตะวันออกและทิศตะวันตก มีแม่น้ำสำคัญไหลผ่านคือ แม่น้ำป่าสักเพชรบูรณ์มีเนื้อที่ประมาณ 12,668 ตารางกิโลเมตร ด้านทิศเหนือติดต่อกับจังหวัดเลย ทิศใต้ติดต่อจังหวัดลพบุรี ทิศตะวันออกติดต่อกับจังหวัดจังหวัดขอนแก่นและชัยภูมิ ทิศตะวันตกติดต่อกับจังหวัดพิษณุโลก นครสรรค์และพิจิตร แบ่งการปกครองออกเป็น 11 อำเภอ คือ อำเภอเมืองเพชรบูรณ์ อำเภอหล่มสัก อำเภอหล่มเก่า อำเภอชนแดน อำเภอหนองไผ่ อำเภอบึงสามพัน อำเภอวิเชียร อำเภอศรีเทพ อำเภอวังโป่ง อำเภอน้ำหนาวและอำเภอเขาค้อ</p>
        </div>
      </div>
    </div>
    <div class="col-md-12">
    <div class="panel panel-default">
      <div class="panel-heading">
        <h4><span class="glyphicon glyphicon-cloud"></span>&nbsp; ประวัติความเป็นมาของจังหวัดเพชรบูรณ์</h4>
      </div>
      <div class="panel-body">
        <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
หลักฐานทางประวัติศาสตร์ ที่กล่าวถึงเมืองเพชรบูรณ์เท่าที่ค้นพบมีหลักฐานปรากฏทั้งในสมัยกรุงสุโขทัย สมัยกรุงศรีอยุธยา สมัยกรุงธนบุรี และกรุงรัตนโกสินทร์ ดังนี้
 <br>
๏ สมัยสุโขทัย       
          สมเด็จพระเจ้าบรมวงศ์เธอกรมพระยาดำรงราชานุภาพ และสมเด็จพระเจ้าบรมวงศ์เธอเจ้าฟ้ากรมพระยานริศรานุวัติวงศ์ ทรงมีลายพระหัตถ์เกี่ยวกับเพชรบูรณ์ว่า เดิมทีเดียวคงตั้งชื่อเป็นเมือง “เพชรบูร” ให้ใกล้กับ “เพชรบุรี” ซึ่งแปลว่า “เมืองแข็ง” แต่เกรงว่าจะเหมือนกันมากเกินไปจึงตั้งชื่อเป็น “เพชรบูรณ์” ซึ่งคาดว่าชื่อเมืองคงจะตั้งรุ่นเดียวกับเมืองพิษณุโลก คำว่า “เพชรบูรณ์” อาจมาจากคำว่า “พืช” ซึ่งหมายถึงที่เกิดของพืชผลก็ได้ แม้ในอินเดียเองก็มีเมือง BIJPURE ซึ่งพอเทียบได้กับ “พืชบุระ” ส่วนชื่อเมืองเพชรบูรณ์เขียนเป็น 2 แบบ คือ เพชรบูรณ์ และ เพชรบูร ส่วนชื่อใดจะผิดหรือถูกนั้น อาจจะพิจารณาจากศิลาจารึกสมัยกรุงสุโขทัย (หลักที่ 93) จากวัดอโศกการาม (พ.ศ.1949) ซึ่งมีข้อความตอนหนึ่งพาดพิงถึงเมืองเพชรบูรณ์ดังต่อไปนี้
   <br>       “รัฐมณฑลกว้างขวาง ทั้งปราศจากอันตรายและนำมาซึ่งความรุ่งเรือง รัฐสีมาของพระราชาผู้ทรงบุญญาสมภาคพระองค์นั้น เป็นที่รู้จักกันอยู่ว่าในด้านทิศตะวันออก ทรงทำเมืองวัชชะปุระเป็นรัฐสีมา” จากศิลาจารึกหลักนี้แสดงให้เห็นถึงอาณาเขตของกรุงสุโขทัยในสมัยพระมหาธรรมราชา     ลิไท (พ.ศ.1911) เป็นอย่างดีโดยเฉพาะด้านตะวันออกเฉียงใต้ของเมืองสุโขทัย ได้แก่ “วัชชะบุระ” ดังนั้น ชื่อเมืองเพชรบูรณ์จึงน่าจะมาจากคำว่า “บุระ” หรือ “ปุระ” ซึ่งแปลว่าเมืองป้อม หอ วัง (ป) ส่วนคำว่า บูรณ์ มาจากคำว่า “ปูรณ (ส)” แปลว่าเต็ม
          <br>นายมนตรี อมาตยกุล เขียนไว้ในเรื่อง สำรวจเมืองโบราณ ในอาณาจักรสุโขทัยตอนหนึ่งว่า ”เมืองเพชรบูรณ์นี้ ในสมัยสุโขทัย จะเรียกชื่อว่าเมืองอะไรยังไม่สามารถค้นหลักฐานได้ มีผู้สันนิษฐานว่าอาจจะเป็นเมืองราดก็ได้แต่ผมเห็นว่ายังไม่มีหลักฐานเพียงพอจะต้องตรวจสอบค้นต่อไป
      <br>    หลักฐานทางโบราณคดีซึ่งเป็นสิ่งที่ชี้ชัดว่า “เมืองเพชรบูรณ์” เป็นรัฐสีมาของสุโขทัย ดังโบราณพระเจดีย์ทรงพุ่มข้าวบิณฑ์หรือดอกบัวตูม ซึ่งเป็นพระประธานของวัดมหาธาตุเมืองเพชรบูรณ์ เช่นเดียวกับวัดมหาธาตุของเมืองสุโขทัย และเมืองอื่นๆ ซึ่งจัดเป็นพุทธสถาปัตยกรรมสมัยสุโขทัยโดยแท้ และในการขุดค้นเมืองโบราณคดีที่พระเจดีย์ทรงพุ่มข้าวบิณฑ์หรือดอกบัววัดมหาธาตุเมืองเพชรบูรณ์ ของกรมศิลปากร เมื่อ พ.ศ.2510 ได้พบศิลปวัตถุมากมาย เช่นเครื่องสังคโลกของไทย และเครื่องถ้วยตุ๊กตาจีน
 <br>
๏ สมัยกรุงศรีอยุธยา    
          เหตุผลที่เรื่องราวของเมืองเพชรบูรณ์ได้เกี่ยวกับในสมัยกรุงศรีอยุธยา ที่พอจะยกเอาข้อความกล่าวได้ดังนี้ กฎหมายที่ตราขึ้นในสมัยสมเด็จพระบรมไตรโลกนาถ ว่าด้วยการเทียบศักดินาหนึ่งหมื่นได้แก่ตำแหน่งต่อไปนี้
          ฝ่ายทหาร<br>
1.     เจ้าพระยาอุปราช (ตำแหน่งพิเศษ)<br>
2.     เจ้าพระยามหาเสนาบดี (สมุหกลาโหม)<br>
3.     พระยาศรีหราชเดโชชัย (ประจำกรุง)<br>
4.     พระยาท้ายน้ำ (ประจำกรุง)<br>
5.     พระยาสุรสีห์ (ประจำพิษณุโลก)<br>
6.     พระยาศรีธรรมราช (ประจำนครศรีธรรมราช)<br>
7.     พระยาเกษตรสงคราม (ประจำสังคโลก)<br>
8.     พระยาศรีธรรมาโศกราช (ประจำสุโขทัย)<br>
9.     พระยารามรณรงค์ (ประจำกำแพงเพชร)<br>
10.   พระยารัตน์สงคราม (ประจำเพชรบูรณ์)<br>
11.   พระยากำแหงสงคราม (ประจำราชสีมา)<br>
12.   พระยาไชยาธิบดี (ประจำตะนาวศรี)<br>
แต่เดิมในสมัยสมเด็จพระมหาจักรพรรดิแห่งกรุงศรีอยุธยา ได้เคยทำสัมพันธ์ไมตรีกับพระยาไชย     เชษฐาธิราช แห่งนครเวียงจันทร์ เพราะเกรงว่าพระเจ้าหงสาวดีบุเรงนองแห่งพม่าจะยกทัพมาตี ซึ่งต่อมาในปีจุลศักราช 930 ตรงกับสมัยสมเด็จพระมหาธรรมราชา ก็เป็นจริงตามที่พระมหาจักรพรรดิทรงคาดการณ์ไว้ดังข้อความตอนหนึ่งว่า “พระไชยเชษฐายังมีโอกาสปฏิบัติตามสัญญาพันธมิตรที่ได้ให้ไว้ต่อกัน ณ เจดีย์ศรีสองรัก คือ อีกห้าปีต่อมาในจุลศักราช 930 พระเจ้าหงสาวดีบุเรงนองยกทัพมาตีกรุงศรีอยุธยาอีกครั้งหนึ่ง ครั้งนี้ได้รบพุ่งกันเป็นเวลา 8 เดือน จนถึงเดือนเก้าจุลศักราช 930 มะเส็งศก จึงเสีย
<br>กรุงศรีอยุธยาให้แก่พม่า ทัพพระไชยเชษฐาจึงได้ส่งกองทัพมาช่วยทางด่านเมืองนครไทยเข้ามาทางเมืองเพชรบูรณ์จะลงมาทางเมืองสระบุรีเป็นทัพระหนาบ”
<br> 
นอกจากนั้นยังมีเหตุการณ์ สมัยสมเด็จพระมหาธรรมราชาที่กล่าวถึง เมืองเพชรบูรณ์ ดังต่อไปนี้
<br>จุลศักราช 919 เดือนยี่ ปีมะเส็ง นพศก (ราว พ.ศ.2100) พระยาระแวกเจ้าแผ่นดินเขมรยกกำลังพลประมาณสามหมื่น รุกรานเข้ามาทางเมืองนครนายก สมเด็จพระมหาธรรมราชา ได้ตรัสปรึกษาในการศึกษาคราวนี้เสนาบดีมุขมนตรีทั้งหลาย ถวายความเห็นว่าคราวกรุงศรีอยุธยาแตก เกรงว่าจะรับทัพเขมรป้องกันพระนครไว้ไม่ได้ ขอเชิญเสด็จประทัพที่เมืองพิษณุโลก ให้พ้นราชศัตรูก่อน สมเด็จพระมหาธรรมราชาก็ทรงมีบัญชาตามจึงมีพระบรมราชโองการตรัสสั่งให้ขุนเทพอรชุน ได้จัดเตรียมเรือพระที่นั่ง และเรือประทับเทียบอพยพไปเมืองพิษณุโลก
<br>ขณะนั้นพระเพชรรัตน์เจ้าเมืองเพชรบูรณ์ มีความผิด ทรงพระกรุณาให้ออกจากเจ้าเมือง มีข่าวลือไปถึงกรุงศรีอยุธยาว่า พระเพชรรัตน์โกรธคิดช่องสุมคน คอยดักทางเพื่อจะปล้นทัพหลวงเมื่อเสด็จผ่านเมืองพิษณุโลก สมเด็จพระมหาธรรมราชา ทรงได้รับคำแนะนำจากขุนเทพอรชุนให้ต่อสู้กองทัพพระยาระแวกทรงเห็นชอบด้วย จึงกลับพระทัยไม่เสด็จไปเมืองพิษณุโลกและได้จัดทัพตีพระยาระแวกแตกไป
<br>ในสมัยสมเด็จพระมหาธรรมราชายังไม่กล่าวถึงเมืองเพชรบูรณ์ ตอนหนึ่งว่า “ครั้งรุ่งขึ้นก็ยกทัพหลวงเสด็จไปเมืองกำแพงเพชร ตั้งประทับแรมอยู่ที่ตำบลหนองปิง 3 วัน แล้วยกไปทางเชียงทอง         กุมตะเมาะ ขณะนั้นพระยากำแพงเพชรได้ส่งข่าวถวายว่าไทยใหญ่เวียงเสือต้นเกียกกาย มี      ขุนปลัดมังทรางมังนวิวายหลวง กับนายม้าทั้งปวงอันอยู่ ณ เมืองกำแพงเพชร ได้พาครอบครัวอพยพหนีพม่า และมอญจึงยกทัพตามไปทันได้รบกันที่ตำบลหนองปิงใหญ่ ไทยใหญ่ทั้งปวงจึงยกไปทางเมืองพิษณุโลก สมเด็จพระนเรศวร ทรงทราบดังนั้นก็ให้ม้าเร็วไปบอกกับหลวงโกษา และลูกขุนอันอยู่รักษาเมืองพิษณุโลกว่าซึ่งไทยใหญ่หนีมานั้นเลือกจะเป็นเมืองอื่นให้แต่อายัดด่านเพชรบูรณ์ เมืองนครไทยชาติตระการและรักษาให้มั่งคงไว้อย่าให้ไทยใหญ่ออกไปรอด หลวงโกษาและลูกขุนทั้งปวงตามรับสั่ง
 <br>
๏ สมัยกรุงธนบุรี
<br>จุลศักราช 1007 เดือนสี่ (ตรงกับ พ.ศ.2218) เจ้าพระยาจักรี (สมเด็จพระพุทธยอดฟ้าจุฬาโลก) เจ้าพระยาสุรสีห์ (กรมพระราชวังบวรมหาสุรสีหนาท) ได้นำกองทัพตีแตกทัพอแซหวุ่นกี้ (พม่า) ที่ล้อมเมืองพิษณุโลกมาได้และมาชุมนุมพักทัพที่เมืองเพชรบูรณ์
       <br>   หลังจากเหตุการณ์นี้แล้ว ไม่ปรากฏหลักฐานทางประวัติศาสตรที่กล่าวถึงเมืองเพชรบูรณ์จนกระทั่งสมัยรัตนโกสินทร์มีกล่าวถึงต่อไปนี้
 
<br> 
๏ สมัยกรุงรัตนโกสินทร์
<br>มีข้อความในหนังสือนิทานโบราณคดี พระนิพนธ์สมเด็จพระยาดำรงราชานุภาพ ทรงกล่าวถึงเมืองศรีเทพและเพชรบูรณ์ “ฉันไปถามมณฑลเพชรบูรณ์นั้นมีกิจอย่างหนึ่งที่จะสืบเมืองโบราณด้วย ด้วยเมื่อแรกฉันเป็นเสนาบดีกระทรวงมหาดไทย ก็ไม่มีใครรู้เมืองศรีเทพอยู่ที่ไหน ต่อมาฉันพบสมุดดำอีกเล่มหนึ่งเป็นต้นร่าง กะทางให้คนเชิญตราไปบอกข่าวสิ้นรัชกาลที่ 2 ตามหัวเมือง เป็นทางๆ ให้คนหนึ่งเชิญตราไปบอกข่าว”เมืองสระบุรี เมืองชัยบาดาล เมืองศรีเทพ และเมืองเพชรบูรณ์
         <br> สำหรับพระราชพงศาวดารกรุงรัตนโกสินทร์รัชกาลที่ 4 ซึ่งมีชื่อเจ้าเมืองเพชรบูรณ์ด้วยดังนี้
          <br>เมืองวิเชียรบุรี   - พระยาประเสริฐสงคราม ประเทศราไชอภัย พีรียทาห แปลงเป็นพระยาเลิศ
                                  <br>   สงคราม เขต ประเทศราไชยอภัย พีรียทาห 
       <br>   เมืองเพชรบูรณ์ - พระเพชรพิชัยปลัดแปลงว่า พระเพชรพีรียทาหปลัด
        <br>  หลักฐานอันเกี่ยวกับประวัติศาสตร์เมืองเพชรบูรณ์ที่ปรากฏชัดแจ้งมาก เป็นเหตุการณ์ที่เกิดขึ้นสมัยรัชกาลที่ 5 ดังจะเห็นได้จากพระราชนิพนธ์นิทานโบราณคดีของสมเด็จพระยาดำรงราชานุภาพ เรื่องความไข้ที่เพชรบูรณ์ ดังนี้
<br>“หัวเมืองที่ขึ้นชื่อลือเรื่องว่ามีไข้มาลาเรียร้ายกาจแต่ก่อนมามีหลายเมือง เช่น เมืองกำแพงเพชรและเมืองกำเนิดนพคุณคือ บางตะพาน เป็นต้นที่ไหนๆ คนไม่ครั่นคร้ามเท่าความไข้ที่เมืองเพชรบูรณ์ดูเป็นที่เข้าใจกันทั่วไปว่า ถ้าใครไปเมืองเพชรบูรณ์เหมือนเข้าหาสู่ความตาย จึงไม่มีข่าวกรุงเทพฯหรือชาวเมืองอื่นๆ พอใจจะไปเมืองเพชรบูรณ์มาช้านาน แม้ในการปกครองรัฐบาลก็ต้องเลือกหาคนในท้องถิ่นที่ตั้งมาเป็นเจ้าเมืองกรมการ เพราะเหตุนี้คนกลัวความไข้เมื่อแรกฉันเป็นเสนาบดีกระทรวงมหาดไทยก็ต้องปล่อยให้เมืองเพชรบูรณ์กับเมืองอื่นๆ ในลุ่มแม่น้ำป่าสักทางฝ่ายเหนือคือ เมืองหล่มสักและเมืองวิเชียรเป็นอยู่อย่างเดิมมาหลายปี เพราะจะรวมเมืองเหล่านั้นเข้ากับมณฑลพิษณุโลกหรือ มณฑลราชสีมา มีเขตติดต่อกันก็มีเทือกเขากั้น สมุหเทศาภิบาล จะไปตรวจตราลำบากทั้งสองทาง อีกประการหนึ่งเมื่อแรกฉันจัดการปกครองหัวเมืองมณฑลต่างๆ ของคนออกไปรับราชการ ฉันยังหาส่งไปให้ไม่ทันเมืองทางลำน้ำป่าสักมีเมืองเพชรบูรณ์ เป็นต้น ไม่มีใครสมัครไปด้วย กลัวความไข้ ดังกล่าวมาแล้วต้องรอมา”
<br>สมเด็จพระยาดำรงราชานุภาพ ทรงคิดอุบายที่จะระงับความกลัวไข้ เมืองเพชรบูรณ์ได้ทรงกล่าวว่าเห็นว่าตัวฉันต้องขึ้นไปเมืองเพชรบูรณ์เองได้ปรากฏเสียสักครั้งหนึ่งคนจึงจะหายกลัว ชักชวนก็ง่ายขึ้นด้วยอาจจะต้องอ้างตัวอย่างว่า แม้ตัวฉันก็ได้ไปแล้ว พระยาเพชรรัตน์ชอบใจว่า ถ้าฉันไปคนก็เห็นจะหายกลัวได้จริง พอข่าวปรากฏว่าฉันเตรียมตัวไปเมืองเพชรบูรณ์ ก็มีพวกพ้องพากันมาให้พร คล้ายกับส่งไปทัพบ้างมาห้ามปรามบ้าง โดยเมตตาปราณีด้วยเห็นว่าไม่พอที่ฉันจะเสี่ยงภัยบ้าง แต่ส่วนพระองค์สมเด็จพระพุทธเจ้าหลวงนั้นทรงพระราชดำริเห็นชอบด้วย ตั้งแต่ฉันกราบทูลความคิดที่จะไปมณฑลเพชรบูรณ์ตรัสว่า ไปเถิดอย่ากลัว สมเด็จพระพุทธยอดฟ้าจุฬาโลกฯ ของเราท่านก็เสด็จไปแล้ว
 
 <br>
“ฉันไปเมืองเพชรบูรณ์เมื่อวันที่ 4 กุมภาพันธ์ ท้องที่มณฑลเพชรบูรณ์บอกแผนที่ไม่ยาก ถือลำน้ำป่าสักเป็นแนวตั้งแต่เหนือมาใต้ มีภูเขาสูงเป็นเทือกลงมาตามแนวลำน้ำทั้งสองฟาก เทือกเขาทางด้านตะวันออกเป็นเทือกเขาปันน้ำต่อแดนมณฑลนครราชสีมา เทือกเขาตะวันตกเป็นเขาต่อแดนมณฑลพิษณุโลก เทือกเขาทั้งสองข้างนั้นบางแห่งก็ห่าง บางแห่งก็ใกล้แม่น้ำป่าสัก เมืองหล่มสักอยู่ที่สุดลำน้ำทางข้างเหนือ แต่ลงมาถึงเมืองเพชรบูรณ์ ทำเลเมืองเพชรบูรณ์พ้นที่ลุ่มขึ้นไปเป็นที่ราบทำนาได้ผลดี เมืองเพชรบูรณ์จึงสมบูรณ์ด้วยกสิกรรมจนถึงชาวเมืองทำนาปีหนึ่งได้ข้าวพอกันกิน สิ่งซึ่งเป็นสินค้าชาวเพชรบูรณ์คือ ยาสูบเพราะรสดีกว่ายาสูบที่อื่นทั้งหมดในเมืองไทย”
        <br>  หลังจากที่สมเด็จกรมพระยาดำรงราชานุภาพ ทรงตรวจราชการมณฑลเพชรบูรณ์ และเสด็จกลับกรุงเทพฯทรงอ้างหลักฐานยืนยันที่จะระงับความกลัวไข้ที่เมืองเพชรบูรณ์ไว้ใน เรื่องความไข้ที่เมืองเพชรบูรณ์ พอรุ่งขึ้นฉันก็ไปเฝ้า วันนั้นมีพระราชพิธีเสด็จออกจากพระที่นั่งอัมรินทร์วินิจฉัยเจ้านาย และข้าราชการเข้าเฝ้าอยู่พร้อมกันเมื่อเสร็จพิธีสมเด็จพระพุทธเจ้าหลวงทรงพระราชดำเนิน มายังที่ฉันยืนเฝ้าอยู่ทรงพระกรุณาโปรดเกล้าฯพระราชทานพระหัตถ์มาจับมือฉันดำรัสว่า ท่านยินดีที่ฉันไปถึงเมืองเพชรบูรณ์แล้วตรัสถามว่ามีใครไปเจ็บไข้บ้างหรือไม่ ฉันกราบทูลว่า ด้วยเดชะพระบารมีปกเกล้าฯ หามีใครเจ็บไข้ไม่แล้วจึงเสด็จขึ้นฉันรู้สึกว่าได้พระราชทานบำเหน็จพิเศษคุ้มค่าเหนื่อย ว่าถึงประโยชน์ได้ไปครั้งนั้นก็ได้สมประสงค์ เพราะแต่นั้นมาก็หาคนไปรับราชการในมณฑลเพชรบูรณ์ได้ไม่ยาก
         <br> ในสมัยรัชกาลที่ 5 ได้มีการจัดตั้งมณฑลเทศาภิบาลขึ้นได้รวบรวมหัวเมืองต่างๆ เข้าเป็นมณฑลในปี พ.ศ.2436 และในปี พ.ศ.2440 ได้ยกฐานะเมืองเพชรบูรณ์ขึ้นเป็นมณฑลเพชรบูรณ์ให้มีผู้ว่าราชการเมืองเพชรบูรณ์ดำรงตำแหน่ง สมุหเทศาภิบาล ยกฐานะอำเภอหล่มสักขึ้นเป็นจังหวัดหล่มสัก ในพ.ศ.2447 ยุบมณฑลไปขึ้นมณฑลพิษณุโลก เพราะเห็นว่ามีแต่จะสิ้นเปลืองค่าใช้จ่าย เพราะการติดต่อลำบาก ต่อมาในปี พ.ศ.2450 ทรงพระกรุณาโปรดเกล้าฯ ตั้งมณฑลเพชรบูรณ์ขึ้นอีกเป็นครั้งที่สอง จนกระทั่งถึง พ.ศ.2458 ตรงกับรัชสมัยของพระบาทสมเด็จพระมงกุฏเกล้าเจ้าอยู่หัว รัชกาลที่ 6 ให้ยุบมณฑลเพชรบูรณ์ไปขึ้นกับมณฑลพิษณุโลกจึงมีฐานะเป็นเมืองเพชรบูรณ์ตามเดิม และต่อมาได้มีการ
<br>ยกเลิกมณฑลต่างๆ เมื่อได้มีประกาศใช้พระราชบัญญัติระเบียบราชการบริหารแห่งราชอาณาจักรสยาม พ.ศ.2475 เป็นต้นมา
<br>ส่วนเหตุการณ์ในสมัยรัชกาลที่ 6 ที่เกี่ยวข้องกับจังหวัดเพชรบูรณ์ก็คือ เมื่อปลายปี พ.ศ.2453 พระบาทสมเด็จพระมงกุฏเกล้าเจ้าอยู่หัว รัชกาลที่ 6 ภายหลังขึ้นเถลิงถวัลย์ราชสมบัติแล้ว มีพระราชพิธีราชาภิเษกทรงรับน้ำจากสระมนต์ (ปัจจุบันถมเต็มหมด) ในวัดมหาธาตุไปร่วมในพระราชพิธีเรื่องนี้ นายทอง ไกรโชคเป็นผู้หนึ่งที่ร่วมไปในขบวนส่งน้ำด้วย
 <br>
๏ นครบาลเพชรบูรณ์
<br>ในระหว่างสงครามโลกครั้งที่ 2 และสงครามมหาเอเชียบูรพา ประเทศไทยกำลังอยู่ในภาวะคับขันกรุงเทพฯซึ่งเป็นเมืองหลวงของประเทศไทยเป็นจุดยุทธศาสตร์ที่ฝ่ายตรงข้ามมุ่งโจมตีจนผู้คนต้องอพยพออกต่างจังหวัดเป็นส่วนมาก รัฐบาลสมัยนั้นมี จอมพล ป.พิบูลสงคราม เป็นนายกรัฐมนตรีจอมพล ป.พิจารณาเห็นว่าสถานการณ์ทางการเมืองขณะนั้นทำให้กรุงเทพฯล่อแหลมต่ออันตรายที่จะเกิดขึ้นจากศัตรู ควรจะได้ทีการโยกย้ายเมืองหลวงของไทยไปอยู่ในพื้นที่ที่ปลอดภัยเพื่อเป็นการฟื้นฟูสถาบันศาสนาให้พัฒนาปลุกคนไทยให้เกิดชาตินิยมมีความรักชาติ ศาสนา และพระมหากษัตริย์ จอมพล ป. มองเห็นการณ์ไกล ต้องแยกศูนย์ราชการศูนย์การค้าออกจากกัน เหมือนกับสหรัฐอเมริกาที่แยกเมืองหลวงใหญ่ คือ วอชิงตัน D.C. ขึ้นแทน ใช้กรุงนิวยอร์คเป็นเมืองท่า เพราะอยู่ติดทะเล และเห็นว่าจังหวัดเพชรบูรณ์ชัยภูมิเหมาะสม เพราะมีภูเขาล้อมรอบมาทางออกทางเดียว ศัตรูรุกรานได้ยาก ดังนั้นคณะรัฐมนตรี อันมี จอมพล ป. พิบูลสงคราม เป็นนายกรัฐมนตรีจึงได้ยกร่างพระราชกำหนดสร้างนครบาลขึ้นและย้ายสถานที่ราชการส่วนกลางมาตั้งที่จังหวัดเพชรบูรณ์ พระราชกำหนดนครบาลใหม่นี้ชื่อ “พระราชกำหนดระเบียบการบริหารนครบาลเพชรบูรณ์ พ.ศ.2478”
<br>ในการบริหารนครบาลเพชรบูรณ์ครั้งนั้น จึงให้มีคณะกรรมการนครบาลเมืองเพชรบูรณ์สังกัดกระทรวงมหาดไทย รองข้าหลวงนครบาลกับหัวหน้าที่ตามกฎหมาย และมีอำนาจของอธิบดีตามกฎหมายด้วย
<br>เมื่อข่าวการตราพระราชกำหนดนครบาลเพชรบูรณ์แพร่หลายออกไปสร้างความดีใจให้แก่ชาวเพชรบูรณ์อย่างมากจนคนในสมัยนั้นพากันยกย่องชมเชยว่าจังหวัดเพชรบูรณ์ คือ สวิตเซอร์แลนด์เมืองไทย หน่วยราชการต่างๆ จากส่วนกลางก็ได้ขยับขยายจัดตั้งหน่วยทำการ
<br>แต่พอพระราชกำหนดนี้นำเข้าสู่สภาผู้แทนราษฎรเพื่อขอความเห็นชอบ ปรากฏว่าฝ่ายรัฐบาลแพ้เสียงข้างมาก เพราะสภาผู้แทนราษฎรสมัยนั้น เห็นว่าเป็นการสิ้นเปลืองโดยเปล่าประโยชน์กับทั้งทำให้ประชาชนที่รัฐบาลเกณฑ์มาสร้างถนน สายตะพานหิน – เพชรบูรณ์ ซึ่งเป็นทางออกทางเดียวต้องเสียชีวิตมากมาย จึงลงมติไม่ไว้วางใจนายกรัฐมนตรีในที่สุด จอมพล ป.พิบูลสงคราม ได้ยื่นใบลาออกจากตำแหน่ง เมื่อวันที่ 24 กรกฏาคม พ.ศ.2487 นครบาลเพชรบูรณ์เป็นอันสิ้นสุดลงเมื่อสงครามโลกครั้งที่ 2 ยุติลง หน่วยราชการต่างๆ ก็ย้ายยกกลับเข้ากรุงเทพฯเช่นเดิม</p>
        </div>
      </div>
    </div>
      </div>

      <script src="https://ajax.googleapis.com/ajax/libs/jquery/1.11.1/jquery.min.js"></script>
      <script src="js/bootstrap.min.js"></script>
      <script src="js/docs.min.js"></script>
      <script>
	var xmlhttp = new XMLHttpRequest();

	xmlhttp.onreadystatechange=function(){
		if(xmlhttp.readyState==4 && xmlhttp.status==200){ 
			document.getElementById("adver").innerHTML = xmlhttp.responseText;
			
		}
	}

	var url="loadnews.jsp";
	xmlhttp.open("GET",url,true);
	xmlhttp.send();
</script>
    </body>
    </html>
</html>